<!DOCTYPE html>
<html>

<head>
	<link rel="stylesheet" type="text/css" href="./style.css">
</head>

<body>

	<div id="header">
		<h1>Grugrue</h1>
	</div>

	<div id="nav">
		<a href="./home_page.html">Accueil</a><br>
		<a href="./proposition_recherche.html">Proposition de recherche</a><br>
		<a href="./acquisition_connaissances.html">Acquisition des connaissances</a><br>
		<a href="./demarche_experimentale.html">D&eacute;marche exp&eacute;rimentale </a><br>
		<a href="./difficultes_rencontres.html">Difficult&eacute;s rencontr&eacute;es </a><br>
		<a href="./resultat_recherche.html">Analyse des r&eacute;sultats de la recherche</a><br>
		<a href="./conclusion_recherche.html">Conclusion de la recherche et bilan</a><br>
		<a href="./bibliographie_telechargement.html">Bibliographie et t&eacute;l&eacute;chargement</a><br>
	</div>

	<div id="section">
		<h2>D&eacute;marche exp&eacute;rimentale</h2>
		<h3>D&eacute;marche d'exp&eacute;rimentation</h3>
		<h4>Description du processus d'exp&eacute;rimentation</h4>
		<p>
			Comme nous avons planifi&eacute; notre exp&eacute;rimentation initialement, notre d&eacute;marche d'exp&eacute;rimentation a presque suivi la m&ecirc;me voie, tout au long du projet.

			Nous avons d'abord commenc&eacute; par faire des recherches sur les langages JSON et JavaScript. En effectuant une &eacute;tude plus approfondie, nous avons d&eacute;couvert l'utilit&eacute; d'un manifest JSON, qui est le point d'entr&eacute;e de notre extension, tout en contenant des informations importantes au contenu de cette application. Nous avons d&eacute;couvert que ce fichier essentiel permet de s&eacute;lectionner l'ic&ocirc;ne de l'extension et de la d&eacute;finir, appeler la page html &agrave; utiliser, d&eacute;terminer &agrave; quels sites est-il permis d'utiliser les donn&eacute;es en rapport &agrave; l'application et de la d&eacute;marrer, ainsi que plusieurs autres fonctionnalit&eacute;s.

			Ensuite, nous avons utilis&eacute; Notepad++ comme &eacute;diteur de texte, afin de pouvoir &eacute;crire notre code JavaScript. Cet outil nous permettait d'alterner facilement et rapidement entre les scripts utilis&eacute;s, ainsi qu'&agrave; nous proposer des options de compl&eacute;tion de termes, afin de perdre le moins de temps possible (IntelliSense). En plus, lorsque l'on pla&ccedil;ait de commandes reli&eacute;es aux langages, ce programme les affichait en couleur, ce qui permettait une plus grande clart&eacute; du code.

			En vue de produire une extension bien faite et simple &agrave; utiliser, nous avons poursuivi nos recherches en HTML et CSS, en suivant des tutoriels en ligne et en exp&eacute;rimentant, avec essais et erreurs, &agrave; l'aide d'outils sp&eacute;cialement con&ccedil;us comme l'&eacute;diteur HTML en ligne de w3school. Cet accessoire, pr&eacute;sent&eacute; avec des centaines d'exemples HTML, CSS et JavaScript, nous a grandement aid&eacute; dans nos recherches et nous a permis d'acqu&eacute;rir des connaissances dans le domaine de ces langages, beaucoup plus rapidement et facilement.

			Gr&agrave;ce au mode d&eacute;veloppeur de Google Chrome au sujet des extensions, nous avons en effet pu importer notre code et le transf&eacute;rer sur le navigateur Google Chrome, de fa&ccedil;on &agrave; pouvoir l'utiliser facilement sur le Web. C'est enti&egrave;rement sur cet outil que repose la partie visuelle de notre application, qui se trouve &agrave; &ecirc;tre une extension Google Chrome.

			Lorsqu'est venu le temps de cr&eacute;er notre fonctionnalit&eacute; de raccourcis, la librairie MouseTrap nous a grandement aid&eacute;. En effet, cette librairie facile &agrave; utiliser offre du code pr&eacute;con&ccedil;u qui permet de connecter les touches utilis&eacute;es &agrave; des actions, ce qui a facilit&eacute; notre exp&eacute;rience. Cet outil, indispensable &agrave; notre extension, a permis de r&eacute;gler plus d'un probl&egrave;me qu'on avait au d&eacute;part. &Eacute;tant donn&eacute; notre incapacit&eacute;, m&ecirc;me en empruntant du code un peu partout sur les forums, d'effectuer constamment un script recherchant si une touche est press&eacute;e, MouseTrap a pu corriger nos complications &agrave; ce sujet.

			Puis, au moment de concevoir la partie du travail qui consistait &agrave; faire en sorte de pouvoir modifier certains aspects de la page, comme la couleur, la police ainsi que la grosseur du texte, nous avons eu besoin de la librairie JavaScript JQuery. Au tout d&eacute;but, nous pensions faire une liste de tous les conteneurs de texte de la page en cours et de changer la couleur automatiquement, mais nous nous sommes vite rendu compte que cela n'allait pas &ecirc;tre possible, &eacute;tant donn&eacute; que chaque page web est faite diff&eacute;remment et que les conteneurs ne sont pas toujours les m&ecirc;mes. La librairie JQuery nous a donc aid&eacute; &agrave; ce sujet, en permettant de changer dynamiquement tout le contenu de la page en une simple et seule commande.
		</p>
		<h4>Suivi des incertitudes</h4>
		<p>
			Au tout d&eacute;but de notre projet, nous poss&eacute;dions quelques incertitudes au sujet de la fa&ccedil;on dont notre extension allait avancer. Nous devions apprendre &agrave; nous familiariser &agrave; l'environnement de travail Google Chrome, au HTML au CSS et au JavaScript. Aussi, puisque nous ne poss&eacute;dions aucune autre connaissance dans le domaine, nous voulions placer en priorit&eacute; nos fonctionnalit&eacute;s de raccourcis et de modification du texte, plus particuli&egrave;rement la grosseur de la police, et nous n'&eacute;tions pas certains d'avoir assez de temps pour concevoir un chronom&egrave;tre et un "keylogger". Gr&agrave;ce aux tutoriels pr&eacute;sents sur w3school, &agrave; son &eacute;diteur HTML en ligne, nous avons pu vite apprendre chaque fonctionnement de ces langages dont on avait besoin afin de poursuivre nos fonctionnalit&eacute;s. De plus, avec Notepad++, nous avons rapidement et facilement mis en place les scripts et les pages html dont nous avions besoin. Finalement, les librairies MouseTrap et JQuery nous ont permis de concevoir nos fonctionnalit&eacute;s prioritaires rapidement et de fa&ccedil;on enti&egrave;rement fonctionnelle, ce qui nous a donn&eacute; l'opportunit&eacute; de poursuivre et de continuer notre extension, en plus de d&eacute;buter les options moins importantes que nous voulions faire.
		</p>
		<h4>&Eacute;num&eacute;ration exhaustive des &eacute;l&eacute;ments encore inconnus	</h4>
		<p>
			Au cours de notre recherche, nous avons couvert tous les &eacute;l&eacute;ments que nous voulions au d&eacute;part. Notre exp&eacute;rimentation ressemble beaucoup &agrave; ce que nous avions pr&eacute;vu initialement. Suite &agrave; beaucoup de recherches, au sujet du HTML, du CSS, du JavaScript, des extensions Google Chrome, de MouseTrap ainsi que de JQuery, nous sommes parvenus &agrave; concevoir chaque fonctionnalit&eacute; pr&eacute;vue. Gr&agrave;ce &agrave; plusieurs outils que nous avons utilis&eacute;s, qui nous ont grandement facilit&eacute; la t&agrave;che, nous avons r&eacute;ussi &agrave; &eacute;taler nos connaissances et produire une extension Google Chrome simple &agrave; utiliser, versatile et pratique.
		</p>
		<br>
		<h3>Explication de l'outil et de la m&eacute;thodologie</h3>
		<h4>Description des outils/logiciels utilis&eacute;s et/ou d&eacute;velopp&eacute;s</h4>
		<p>Notepad++</p>
		<p>
			Version alternative et plus avanc&eacute;e du bloc-notes de Microsoft, Notepad++ est un &eacute;diteur de texte g&eacute;n&eacute;rique qui int&egrave;gre la coloration syntaxique de code source pour les langages HTML, JavaScript et bien d'autres. Au cours de notre projet, nous avons utilis&eacute; ce programme afin d'&eacute;crire nos scripts JavaScript et nos pages HTML, que l'on ex&eacute;cutait par le biais de notre extension Google Chrome. Facile et rapide et versatile d'utilisation, avec ses codes de couleur, Notepad++ a facilit&eacute; notre travail en nous offrant un environnement simple et dynamique.
		</p>
		<p>&Eacute;diteur HTML en ligne de w3school</p>
		<p>
			
			&Eacute;diteur HTML permettant de visualiser rapidement et facilement le code HTML ou JavaScript. Au cours de notre projet, nous avons utilis&eacute; cet &eacute;diteur, afin de pouvoir tester instantan&eacute;ment du code.
		</p>
		<p>MouseTrap</p>
		<p>
			
			Librairie permettant la saisie et l'identification de touches de clavier. Au cours de notre projet, nous avons utilis&eacute; cette librairie afin de pouvoir cr&eacute;er notre option de raccourcis. Lorsque l'on presse les touches Shift et Z, sans &ecirc;tre dans un champ texte, on peut ouvrir les pages que l'on a pr&eacute;alablement plac&eacute;es dans les champs reli&eacute;s.
		</p>
		<p>JQuery</p>
		<p>
			Librairie JavaScript permettant une manipulation simple et facile du code HTML pr&eacute;sent sur une page d'un navigateur internet. Au cours de notre projet, nous avons utilis&eacute; cette librairie dans le but de changer l'aspect (couleur, grosseur, police) du texte pr&eacute;sent sur la page.
		</p>
		<h4>Notre projet: Grugrue - Extension Google Chrome</h4>
		<p>
			Extension Google Chrome multiusage, con&ccedil;ue pour les d&eacute;butants et exp&eacute;riment&eacute;s du navigateur Google Chrome. Cette application propose l'utilisation de fonctionnalit&eacute;s vari&eacute;es comme une option de raccourcis de pages internet, pour modifier la couleur, la police ainsi que la grosseur du texte, un chronom&egrave;tre affichant la dur&eacute;e de la navigation Google Chrome ainsi qu'un "keylogger".
			
			Lorsque l'on a le dossier de l'extension sur son ordi (Grugrue n'&eacute;tant pas encore sur le Chrome Web Store), on clique sur l'ic&ocirc;ne d'option du navigateur Google Chrome, pour les faire d&eacute;filer.
			On clique ensuite sur "Historique".
			On choisit l'option "Extensions" &agrave; gauche.
			On clique sur le bouton "Charger l'extension non empaquet&eacute;e..."
			On choisit le dossier de l'extension
		</p>
		<br>
		<h3>Ex&eacute;cutable, sources et documentation</h3>
		<p>
			L'utilisation de notre extension Grugrue a &eacute;t&eacute; con&ccedil;ue la plus simple possible, de fa&ccedil;on &agrave; ce que tout le monde puisse l'utiliser. 
		</p>
		<h4>Raccourcis</h4>
		<p>
			Afin de pr&eacute;d&eacute;finir des raccourcis de page Web, on entre l'URL entier de la page que l'on veut sauvegarder en raccourci (une page par champ texte, pour un total de 5 pages). Apr&egrave;s avoir entr&eacute; les sites voulus, on clique sur le bouton "Sauvegarder". Finalement, on presse les touches Shift et Z en m&ecirc;me temps, lorsque notre curseur ne se situe pas dans un champ texte, afin de faire afficher les pages d&eacute;finies en raccourcis. Si l'on veut retirer une page des raccourcis, on n'a qu'&agrave; l'enlever du champ texte. 
		</p>
		<h4>Options de modification de texte</h4>
		<p>
			Pour changer la taille du texte, choisir la taille dans la liste qui est affich&eacute;e dans le champ "Taille de la police". Pour la remettre &agrave; l'&eacute;tat normal, choisir l'option "normal".

			Pour changer la couleur de la police, &eacute;crire la couleur en anglais que vous voulez s&eacute;lectionner dans le champ "Couleur de la police". Pour la remettre &agrave; l'&eacute;tat normal, enlever le texte du champ.

			Pour changer la couleur de l'arri&egrave;re-plan, &eacute;crire la couleur en anglais que vous voulez s&eacute;lectionner dans le champ "Couleur de l'arri&egrave;re-plan. Pour la remettre &agrave; l'&eacute;tat normal, enlever le texte du champ.

			Pour changer le type de police, &eacute;crire le nom de la police dans le champ "Police". Pour le remettre &agrave; l'&eacute;tat normal, enlever le texte du champ.

			Ensuite cliquer sur le bouton "Sauvegarder"
		</p>
		<h4>Chronom&egrave;tre</h4>
		<p>
			Le chronom&egrave;tre affiche automatiquement le temps &eacute;coul&eacute; depuis le d&eacute;but de la session du navigateur Google Chrome. Pour recommencer le compteur, cliquer sur le bouton "Reset" &agrave; c&ocirc;t&eacute; de celui-ci.
		</p>
		<h4>KeyLogger</h4>
		<p>
			Le "KeyLogger" affiche automatiquement les touches press&eacute;es lorsque l'extension est ouverte. Pour recommencer l'affichage, cliquer sur le bouton "Reset" &agrave; c&ocirc;t&eacute; de celui-ci.
		</p>
		<br>
	</div>

	<div id="footer">
		Copyright &copy; Les Grutiers
	</div>

</body>
</html>