<!DOCTYPE html>
<html>

<head>
	<link rel="stylesheet" type="text/css" href="./style.css">
</head>

<body>

	<div id="header">
		<h1>Grugrue</h1>
	</div>

	<div id="nav">
		<a href="./home_page.html">Accueil</a><br>
		<a href="./proposition_recherche.html">Proposition de recherche</a><br>
		<a href="./acquisition_connaissances.html">Acquisition des connaissances</a><br>
		<a href="./demarche_experimentale.html">D&eacute;marche exp&eacute;rimentale </a><br>
		<a href="./difficultes_rencontres.html">Difficult&eacute;s rencontr&eacute;es </a><br>
		<a href="./resultat_recherche.html">Analyse des r&eacute;sultats de la recherche</a><br>
		<a href="./conclusion_recherche.html">Conclusion de la recherche et bilan</a><br>
		<a href="./bibliographie_telechargement.html">Bibliographie et t&eacute;l&eacute;chargement</a><br>
	</div>

	<div id="section">
		<h2>Proposition de recherche</h2>
		<h3>Le sujet</h3>
		<p>
			Le sujet de notre recherche se trouve &agrave; &ecirc;tre les extensions Google Chrome, disponibles sur le navigateur Google Chrome, qui sont des programmes permettant d'ajouter de nouvelles fonctionnalit&eacute;s au navigateur, afin de permettre la personnalisation du fureteur et de la navigation. 
			Le but de la recherche est de d&eacute;terminer, innover et cr&eacute;er une extension Google Chrome qui serait utile aux utilisateurs et qui permettrait d'am&eacute;liorer leur exp&eacute;rience avec leur navigateur, ainsi que de faciliter leurs actions et manipulations, tout en leur procurant un milieu enrichissant avec l'usage d'Internet. 
			Actuellement, Google offre la possibilit&eacute; aux programmeurs de cr&eacute;er des petits programmes et applications permettant d'ajouter des fonctionnalit&eacute;s &agrave; leur navigateur. 
			Quelques exemples de ces projets, sont AdBlock, qui permet de laisser de c&ocirc;t&eacute; les publicit&eacute;s et de faire en sorte de ne pas les afficher, et le v&eacute;rificateur de messages Google, qui affiche le nombre de message non lus dans la bo&icirc;te de r&eacute;ception Google Mail.
			Nous sommes des habitu&eacute;s de ce navigateur Internet et nous connaissons d&eacute;j&agrave; la base des langages HTML et CSS, mais nous sommes conscients que nous devrons faire beaucoup plus de recherche &agrave; ce sujet, en plus des langages JSON et JavaScript, afin de pouvoir produire une extension de premi&egrave;re qualit&eacute;.
		</p>
		<br>
		<h3>Les enjeux</h3>
		<p>
			Pour compl&eacute;ter ce travail, nous devrons nous familiariser avec l'environnement du navigateur Google chrome, le format de donn&eacute;es textuelles JSON et le langage de programmation de scripts JavaScript. 
			Cette recherche est importante puisque, de nos jours, de plus en plus de personnes utilisent Internet. Certaines personnes ne sont pas famili&egrave;res avec ce genre de technologie. 
			Les extensions Google Chrome peuvent donc, pour les d&eacute;butants, aider leur apprentissage et faciliter leur exp&eacute;rience de navigation. Pour les utilisateurs exp&eacute;riment&eacute;s, cela permettrait de naviguer plus efficacement, plus rapidement, ainsi que de faire des actions plus personnalis&eacute;es. 
			Notre implication dans ce domaine permettrait d'aider les utilisateurs et de leur offrir une nouvelle fa&ccedil;on de naviguer. 
			Nous recherchons sur ce sujet, car nous sommes habitu&eacute;s de vivre dans un tel environnement et nous voulons permettre &agrave; d'autres personnes de profiter de certaines am&eacute;liorations que l'on apporterait au navigateur Google Chrome.
			Nous voulons un outil qui am&eacute;liore la navigation sur Google Chrome. Le navigateur pourra &ecirc;tre utilis&eacute; plus facilement et efficacement gr&acirc;ce aux nouveaux raccourcis clavier qui ouvriront une page ou un ensemble de page pr&eacute;d&eacute;fini par l'utilisateur. Le navigateur sera aussi mieux adapt&eacute; aux personnes qui ont de la mis&egrave;re &agrave; voir de proche, car on pourra d&eacute;sormais changer la police d'une page Web, la grossir, changer sa couleur et aussi changer la couleur de l'arri&egrave;re-plan de la page pour plus de contraste. Deux autres fonctionnalit&eacute;s simples seront disponibles : un enregistreur de frappe et un chronom&egrave;tre.
		</p>
		<br>
		<h3>Les objectifs</h3>
		<p>
			Tout d'abord, nous voulons permettre aux utilisateurs de personnaliser des raccourcis clavier, leur permettant d'acc&eacute;der &agrave; leurs sites favoris plus facilement et rapidement avec un maximum de cinq sites. 
			Nous voulons aussi faire en sorte qu'ils puissent modifier la grosseur et la couleur de la police, la police elle-m&ecirc;me et la couleur de l'arri&egrave;re-plan sur les pages internet visit&eacute;es, afin que ceux ayant de la difficult&eacute; &agrave; voir certains &eacute;l&eacute;ments d'une page Web n'aient plus ce probl&egrave;me.
			Aussi, nous voulons int&eacute;grer deux fonctionnalit&eacute;s, qui ne sont pas essentielles, mais qui pourraient &ecirc;tre amusantes &agrave; utiliser. Il s'agit d'un keylogger, qui afficherait les touches press&eacute;es, et d'un chronom&egrave;tre, qui calculerait la dur&eacute;e de la session sur le navigateur.
		</p>
		<br>
		<h3>L'exp&eacute;rimentation</h3>
		<p>
			Afin de planifier comment produire notre extension, nous devrons nous renseigner sur les possibilit&eacute;s offertes par Google sur la cr&eacute;ation de celle-ci. Ensuite, nous devrons d&eacute;terminer comment appliquer les formats JSON et JavaScript &agrave; nos extensions, afin qu'elles respectent ce que l'on veut faire. 
			Nous devrons aussi approfondir nos connaissances du HMTL et du CSS et travailler avec les outils de d&eacute;veloppement Web. Nous allons faire notre code avec Notepad++ et l'importer sur notre navigateur Google Chrome avec le "Mode d&eacute;veloppeur" de l'outil "Extensions".
			Notre programme devrait donc permettre d'am&eacute;liorer la navigation pour les utilisateurs d'Internet. Il devrait, entre autres, permettre d'instaurer des raccourcis clavier, de modifier la police et la couleur des pages, de garder en m&eacute;moire les touches press&eacute;es et calculer le temps de navigation.
			Puisque l'application serait con&ccedil;ue pour le navigateur Internet, il n'y aurait aucun produit et composantes physiques &agrave; fabriquer et manipuler. Il y aurait toutefois une extension logique &agrave; cr&eacute;er et &agrave; implanter dans Google Chrome. 
			Afin de rechercher en profondeur sur le sujet et sur les langages JSON, JavaScript, HTML et CSS, nous devrons nous renseigner en regardant des tutoriels en ligne, sur Internet, ou encore en lisant des livres &agrave; leur sujet. Puisque nous ne sommes pas des experts en la mati&egrave;re, nous devront commencer par exp&eacute;rimenter et nous exercer avec la base de ces langages, avant de d&eacute;buter notre v&eacute;ritable application.
		</p>
		<br>
		<h3>Les limites</h3>
		<p>
			Nous avons plusieurs fonctionnalit&eacute;s dont nous voudrions que notre extension poss&egrave;de. Toutefois, &agrave; cause de la contrainte de temps, nous devrons nous &eacute;tablir certaines limites. 
			Nous voulons commencer par la cr&eacute;ation de raccourcis, afin que les utilisateurs puissent acc&eacute;der rapidement &agrave; leurs sites favoris. Ensuite, nous allons travailler sur la modification de la police et de la couleur des pages Internet du navigateur. Nous voulons d'abord concentrer notre travail sur ces deux fonctionnalit&eacute;s, afin qu'elles soient optimales et qu'elles soient bien faites. 
			Si nous avons le temps, apr&egrave;s la conception de ces derni&egrave;res, nous nous mettrons &agrave; la t&acirc;che de cr&eacute;ation d'un keylogger, qui d&eacute;terminera quelles touches du clavier seront press&eacute;es. Finalement, nous travaillerions sur le chronom&egrave;tre qui calculerait le temps de session sur le navigateur. 
		</p>
		<br>
	</div>

	<div id="footer">
		Copyright &copy; Les Grutiers
	</div>

</body>
</html>