<!DOCTYPE html>
<html>

<head>
	<link rel="stylesheet" type="text/css" href="./style.css">
</head>

<body>

	<div id="header">
		<h1>Grugrue</h1>
	</div>

	<div id="nav">
		<a href="./home_page.html">Accueil</a><br>
		<a href="./proposition_recherche.html">Proposition de recherche</a><br>
		<a href="./acquisition_connaissances.html">Acquisition des connaissances</a><br>
		<a href="./demarche_experimentale.html">D&eacute;marche exp&eacute;rimentale </a><br>
		<a href="./difficultes_rencontres.html">Difficult&eacute;s rencontr&eacute;es </a><br>
		<a href="./resultat_recherche.html">Analyse des r&eacute;sultats de la recherche</a><br>
		<a href="./conclusion_recherche.html">Conclusion de la recherche et bilan</a><br>
		<a href="./bibliographie_telechargement.html">Bibliographie et t&eacute;l&eacute;chargement</a><br>
	</div>

	<div id="section">
		<h2>Analyse des r&eacute;sultats</h2>
		<p>
			Les objectifs que nous avions &eacute;tablis avant de commencer ce projet &eacute;taient les suivants : permettre aux utilisateurs de personnaliser des raccourcis clavier pour ouvrir des onglets, faire en sorte qu'ils puissent modifier la grosseur et la couleur de la police, la police elle-m&ecirc;me et la couleur de l'arri&egrave;re-plan sur les pages internet visit&eacute;es, int&eacute;grer un "keylogger" et un chronom&egrave;tre. 

			Nous avons r&eacute;ussi &agrave; faire des raccourcis clavier cependant, le raccourci clavier par d&eacute;faut est 'Shift+z' et ne peut &ecirc;tre chang&eacute; et il y a un maximum de cinq onglets &agrave; notre fonctionnalit&eacute;. Notre manque de temps et de connaissances dans cette technologie nous a oblig&eacute; &agrave; faire une version simple qui est tout aussi fonctionnelle et utile, mais un peu moins flexible.

			Pour la modification des pages Web, au tout d&eacute;but, notre objectif &eacute;tait de seulement pouvoir modifier la grosseur de la police. Mais, plus on avan&ccedil;ait, plus nous devenions &agrave; l'aise avec cette technologie. Nous avons donc d&eacute;cid&eacute; que notre application allait permettre de changer la police, sa couleur et la couleur de l'arri&egrave;re-plan. Nous avons donc surpass&eacute; notre objectif de d&eacute;part.

			Pour ce qui est du "keylogger" et du chronom&egrave;tre, nous avons d&eacute;velopp&eacute; exactement ce que nous avions en t&ecirc;te au d&eacute;part. Cependant, nous n'&eacute;tions pas s&ucirc;rs si nous allions avoir le temps de le faire, mais nous avons r&eacute;ussi &agrave; surpasser nos attentes.

			Les seules causes possibles de probl&egrave;mes dans un projet comme celui-l&agrave; seraient : le manque de connaissances et le manque de temps. Pour ce qui est du manque de connaissances, la solution serait de prendre le temps d'approfondir nos recherches sur le sujet en naviguant sur des sites de tutoriel et autres. Cependant, la solution de ce probl&egrave;me nous emm&egrave;ne au second probl&egrave;me : le manque de temps. Il faut donc trouv&eacute; l'&eacute;quilibre parfait entre la qualit&eacute; de l'application et le temps disponible et nous pensons avoir bien g&eacute;r&eacute; cela durant ce projet. 
		</p>
		<br>
	</div>

	<div id="footer">
		Copyright &copy; Les Grutiers
	</div>

</body>
</html>